{
  "name": "06. Edge Async Render: Overview & Stale Edge Cache",
  "description": "Introduction to async rendering with progressive loading, LoadingFallback components, and Stale Edge Cache for dramatically improved performance and UX.",
  "content": "---\n\ndescription: Documentation on async rendering in Deco.cx.\n\n---\n\n## Introduction\n\nAsync rendering is an essential technique for improving performance and user\nexperience in modern web applications. In deco.cx, this feature utilizes\nprogressive loading to load page sections asynchronously, rendering quickly\nloaded content and displaying skeletons and loading states for slower requests,\nproviding users with an immediate visual experience.\n\n## How It Works\n\nAsync rendering in deco.cx is based on loaders, which are components responsible\nfor loading necessary data for a section. Loaders are bound to a time budget.\nOnce this limit is reached, loaders that have finished their tasks will render\ntheir content in the final HTML as usual. Loaders relying on slow APIs will\nthrow an exception, and a loading state will be rendered for those sections.\nThis loading state will use our\n[Partials](https://deco.cx/docs/en/developing-capabilities/interactive-sections/partial)\nfeature to hydrate and lazily replace the missing section.\n\n### Stale Edge Cache\n\nAsync render in deco.cx also features \"Stale Edge Cache,\" which allows caching\nof lazy-loaded sections, significantly reducing response times and improving\nloading speeds. The initial server response of the section is cached in the CDN.\nSubsequent requests are answered with this cached response, drastically reducing\nthe total response time to just the latency between the browser and the CDN,\nplus the download time.\n\n![Stale Edge Cache](https://deco.cx/docs/performance/stale-edge-cache.png)\n\nThis functionality is enabled by default for all sections but can be disabled if\nnecessary.\n\n### Enabling Async Rendering\n\nThis feature is enabled by default in the sections of sites on deco.cx. To\ndisable it, simply turn off the `Optimization` option in the section properties\nin the Admin.\n\n![Disable Async Rendering](https://ozksgdmyrqcxcwhnbepg.supabase.co/storage/v1/object/public/assets/530/3d9ee3b7-cce2-47f3-a320-2a72b2e63e2a)\n\n### Benefits\n\n- **Improved Performance**: Loads only the necessary components at the moment,\n  reducing initial page load time.\n- **Reduced Latency**: Cached responses significantly reduce response times.\n- **Better UX**: Avoids interface blocking and minimizes layout shifts during\n  loading.\n\n### Minimizing Content Layout Shifts (CLS)\n\nTo ensure a smooth user experience, it is recommended to implement the\n`LoadingFallback` component in all site sections. This component provides a\ncustom loading state during async rendering, minimizing potential layout shifts.\n\nYou can find more information about the\n[`LoadingFallback` component in our documentation](https://deco.cx/docs/en/developing-capabilities/sections/loading-fallback).\n\n## Conclusion\n\nAsync rendering is a powerful technique for improving performance and user\nexperience in web applications. With the implementation and evolution of async\nrendering in the deco.cx platform, it has become even easier and more efficient\nto adopt this technique in your projects.\n\nFor more information, refer to the blog posts\n[Async Rendering](https://deco.cx/en/blog/async-rendering) and\n[More on Async Rendering](https://deco.cx/en/blog/async-render-default).\n"
}