{
  "name": "01. Performance Guide: Principles, Testing & Optimization",
  "description": "Master guide covering performance principles, testing methodologies (PageSpeed, Core Web Vitals), debugging techniques, and optimization strategies for images, fonts, scripts, loaders, and islands.",
  "content": "---\ntitle: The deco guide to performance\ndescription: The deco guide to performance\nsince: 1.0.0\n---\n\n## Three rules for high performance\n\n### Understand the framework and system architecture\n\nUsing a tool efficiently implies understanding its components and capabilities.\nThis allows for a healthy codebase from the start.\n\n> **Example**: deco offers components like `Image` that help accelerate the\n> efficient delivery of images, but users can still use the `img` element if\n> they prefer.\n\n### Learn to analyze performance\n\nLearn to analyze the performance of your pages. Navigating a page should not be\nslow, not even for you. **If it's slow for the developer, it will be slow for\nthe user**. Understand the available tools and how they work.\n\n### Monitoring performance is an ongoing task\n\nOnce the system stops performing, it is common to stop caring about performance\nuntil it becomes much more difficult to make corrections. Detecting performance\nissues is an ongoing task, but it should not be an end in itself.\n\n> **Important**: the most important thing (the golden rule) is the user\n> experience. Sometimes the system may not deliver the best performance, as long\n> as it is a conscious decision to deliver the best experience to the user.\n\n## Analyzing page performance\n\nTesting performance involves understanding a series of tools and possible\nmetrics that seek to understand what needs to be improved (and how). There are\ntools that help in this process. Understand how and when to use them.\n\n### Local testing\n\n![Example of using browser tools for debugging](https://github.com/deco-sites/starting/assets/882438/bf441a9a-5af7-4c83-aa4a-c409c2cfb84c)\n\n**Always test your page, section, loader, or action locally. It doesn't always\nneed to be a structured test**. If it's already slow for you, it will be slow\nfor the user.\n\nRun the deployed test versions. Then use the tools available in the browser\nitself to debug performance issues. With them, you can monitor the performance\nof the page in detail and simulate adverse conditions (such as a lower quality\nnetwork or CPU). More information in the guide below:\n\n### Pagespeed test\n\n![Example of pagespeed test](https://github.com/deco-sites/starting/assets/882438/35d915a9-1fa0-4c87-b5b5-74cd60bec8f0)\n\n[Pagespeed](https://pagespeed.web.dev/) is a testing tool developed by Google to\nevaluate the main performance aspects of a page. It explores metrics such as how\nlong it takes for some content to be displayed, how long it takes for the system\nto become interactive, etc.\n\nThe main metrics are described below:\n\n| Metric      | Meaning                                              | example of good value |\n| ----------- | ---------------------------------------------------- | --------------------- |\n| FCP         | First Contentful Paint                               | up to 1.8s            |\n| LCP         | Largest Contentful Paint                             | up to 2.5s            |\n| TBT         | Total Blocking Time                                  | 200ms                 |\n| Speed Index | Performance index of the page's most popular content | up to 3.4             |\n| CLS         | Cumulative Layout Shift                              | up to 0.1             |\n\n> [source (adapted)](https://web.dev/articles/fcp)\n\nGoogle aggregates these metrics into an index between 0 and 100, generating the\npagespeed score.\n\nSince it is a test executed in a production environment, it is subject to\nvariations. However, a sudden drop in the pagespeed score implies looking at the\npage's performance as soon as possible.\n\n### Deco metrics test\n\n![Examples of deco metrics](https://github.com/deco-sites/starting/assets/882438/af592b39-0f4d-405f-a0c6-a212b1677058)\n\nBy default, deco offers a set of metrics that are evaluated on a page. These\nmetrics are specialized especially for systems like deco (SSR with hydration and\nwith a lot of external data loading).\n\n| Metric            | Meaning                                                  |\n| ----------------- | -------------------------------------------------------- |\n| Config LCP        | Loading configuration of the largest content of the page |\n| Page HTML         | Page size in bytes                                       |\n| Page Islands      | Number of islands on the page                            |\n| Islands Props     | Size in bytes of the island's properties                 |\n| Loaders latencies | Response time of the page's loaders                      |\n\nEach metric is decomposed into its components, allowing for better\nidentification of a possible source of performance loss. There is no ideal value\nfor each metric, but it is important to understand that a large HTML impacts\nresponse time for the user and metrics like pagespeed.\n\nA user who downloads at `100 kb/s` will take `5s` to download a `500 kb` page.\nThis is especially impactful for mobile users operating on low-bandwidth\nnetworks or situations.\n\n### Core Web Vitals test\n\n![Example of Core Web Vitals test](https://github.com/deco-sites/starting/assets/882438/f911058f-34b4-4c49-a24b-9351d630a752)\n\nSo far, we have only explored synthetic tests, that is, tests that are performed\nartificially and are only an approximation of the real world. These tests are\nrelevant because a performance drop in a synthetic test usually reflects a\nperformance drop in the real world.\n\nCore Web Vitals represents a collection of metrics extracted from real user\nexperience. It includes pagespeed metrics as well as other metrics specific to\nreal user interaction.\n\n> Access through the\n> [Google CrUX website](https://developer.chrome.com/docs/crux/dashboard) or\n> directly from the CrUX App on your deco site.\n\nSince it is a collected metric, it only has aggregated meaning. Google\ncategorizes the values typically on a month-to-month basis, so it is more of a\nmonitoring metric to diagnose any behavior issues that have gone unnoticed over\ntime or that reflect a change in the page's audience.\n\n### Debugging performance issues\n\nIf, however, none of the tools help in the process of identifying a performance\nissue, perform some manual tests that can identify the cause of the problem:\n\n- If you don't know which change caused a performance loss:\n  - Test older versions of the system to see which version impacted performance.\n\n- If it is not clear, within a version, what makes it slow, eliminate parts of\n  the system until you identify the cause.\n  - For a slow page, eliminate some `sections` until the page returns to good\n    performance. The most recently deleted `section` (or its `loaders` or\n    `islands`) may be the cause of the problem.\n  - Eliminate added dependencies. Check if the system improves with this.\n\n- Update your dependencies.\n  - Performance improvements are constantly added to the system and can fix\n    issues that lead to slowness.\n\n## Performance improvements\n\nAfter identifying a problem, whether through a negative experience or some tests\nindicating an inadequate metric value, action must be taken.\n\nEach test above indicates, for each metric, possible culprits and where to look.\nIf you have identified the culprit, follow one of the guides below to implement\nrelated improvements.\n\nNote that the situations in which you should take action are just examples of\nsome cases.\n\n### ðŸ–¼ï¸ Images (jpg, png, gifs, ...)\n\n**When to act**...\n\n- High LCP value (largest image takes a long time to download / view)\n- Pages \"jumping\" on the screen\n- Large size of downloaded images\n\n**Guide**: [Optimizing images](https://deco.cx/docs/performance/medias/images)\n\n> **Tip**: Use deco image components, such as `<Image>` and `<Picture>`, and\n> configure them correctly, including width and height.\n\n### ðŸ“ˆ Images (SVG)\n\n**When to act**...\n\n- Page size is large and the pages contain embedded and repeated SVGs\n- Issues with Speed Index\n\n**Guide**: [Optimizing SVGs](https://deco.cx/docs/performance/medias/svg-sprites)\n\n### ðŸ–¹ Fonts\n\n**When to act**...\n\n- Text appears to \"change size\" suddenly\n- Font file takes a long time to load\n- High FCP value (indicating the font as the problem)\n\n**Guide**: [Optimizing fonts](https://deco.cx/docs/performance/medias/fonts)\n\n> **Tip**: Use standard fonts offered by Google. If necessary, use smaller fonts\n> (preferably woff/woff2).\n\n### ðŸ“œ Third-party scripts\n\n**When to act**...\n\n- The system takes a long time to load (high TBT)\n- The screen \"jumps\" due to a component inserted by a third-party script (high\n  CLS)\n- A third-party script has a large size\n\n**Guide**: [Optimizing scripts](https://deco.cx/docs/performance/lazy-3rd-party-scripts)\n\n> **Tip**: Try to only use what is strictly necessary or replace third-party\n> scripts with lighter versions. If not possible, postpone the execution of the\n> script until after the page has already loaded and the user is interacting\n> with it.\n\n### ðŸ”„ Data loading efficiency (loaders)\n\n**When to act**...\n\n- The system indicates high latency for a loader\n- The page takes a long time to load initially\n- The size of props in islands is large\n\n**Guide**: [Optimizing loaders](https://deco.cx/docs/performance/loaders)\n\n> **Tips**:\n>\n> - Use `inline loaders` to transform data to be sent to a section and/or island\n> - Consider deferring the display (`Deferred`) of sections with expensive\n>   loaders\n> - Change the loader's props to reduce the amount of data loaded in the loaders\n> - Save loaders that are reused on different pages/sections\n\n### ðŸï¸ Islands\n\n**When to act**...\n\n- The system indicates a large number of islands\n- The page takes a long time to load initially\n- The size of props in islands is large\n\n**Guide**: [Optimizing islands](https://deco.cx/docs/performance/islands)\n\n> **Tips**: Prefer pure CSS to avoid islands. Use `children` to pass JSX into an\n> island. Reduce the scope of the island as much as possible (e.g., prefer a\n> button as an island rather than an entire `form`).\n\n## Relevant sources\n\n- [web.dev - Core Web Vitals](https://web.dev/explore/learn-core-web-vitals)\n\n- [MDN - Web Performance](https://developer.mozilla.org/en-US/docs/Learn/Performance)\n"
}