{
  "name": "15. Third-Party Scripts: Lazy Loading Strategies",
  "description": "Techniques for deferring, async loading, and delaying third-party scripts to minimize blocking time and improve page performance.",
  "content": "---\ndescription: Learn how to use third-party scripts on your website without sacrificing performance.\n---\n\n## Summary\n\n> The use of third-party scripts can have a significant impact on website\n> performance. These scripts often operate in a blocking manner and can hinder\n> page loading times.\n>\n> To reduce the time spent on these scripts, it is recommended to:\n>\n> 1. Avoid using third-party scripts whenever possible\n> 2. Delay the loading of scripts until after user interaction\n> 3. Use async or defer attributes for scripts\n> 4. Preload connection to the script's origin\n\n## Delaying the loading of scripts.\n\nIf the script in question is not a priority, meaning it can wait for user\ninteraction or does not represent a vital functionality for the website, a\nrecommendation is to delay its loading until the user interacts with the site.\n\nEach script may require a different strategy to delay its execution. Below is an\nexample of a common strategy\n([source](https://metabox.io/delay-javascript-execution-boost-page-speed/)) to\ndelay the script so that it is only executed after user interaction followed by\na delay:\n\n```tsx\n<script>\n{\n    const load = () => {\n        // YOUR SCRIPT CONTENT\n    }\n    const timer = setTimeout(load, 5000);\n    const trigger = () => {\n        load();\n        clearTimeout(timer);\n    }\n    const events = [\"mouseover\",\"keydown\",\"touchmove\",\"touchstart\"];\n    events.forEach(e => window.addEventListener(e, trigger, {passive: true, once: true}));\n}\n</script>\n```\n\nAnother alternative is to use the Intersection API, so that the code is executed\nonly when a certain element is in view (useful for things that should only be\nexecuted after the user scrolls on a page).\n\n```jsx\nconst elem = document.getElementById(id);\nconst observer = new IntersectionObserver((items) => {\n  // YOUR SCRIPT CONTENT\n  observer.unobserve(elem);\n});\n\nobserver.observe(elem);\n```\n\n## Async and Defer in Scripts\n\nThe presence of a `<script src=\"script.js\">` tag causes a delay in the execution\nof DOM loading. This is because the browser will respect the order of the\nscripts to download and execute them.\n\nIf the script itself does not manipulate the DOM, it is a strong candidate to be\ndelayed using async. An async script will be downloaded asynchronously and then\nexecuted at the first opportunity before the DOM is loaded:\n\n```html\n<script async src=\"script.js\">\n```\n\nTo execute the script only after the HTML parsing is actually complete, you can\nuse the defer attribute:\n\n```html\n<script defer src=\"script.js\">\n```\n\n## Preload connection to the script's origin\n\nIf possible, it is recommended to serve the script locally (in the `static`\nfolder). If the script is hosted on another domain, the recommendation is to use\nprefetch to speed up the resolution of the script's server DNS:\n\n```jsx\n<link rel=\"dns-prefetch\" href=\"http://example.com\">\n```\n\nIf the script is critical, it is possible to signal, even for the browser to\nstart a connection with the origin, in order to make this connection even more\nefficient:\n\n```jsx\n<link rel=\"preconnect\" href=\"http://example.com\">\n```\n\n> **important**: use preconnect only when necessary and for scripts with a\n> significant impact.\n"
}