{
  "name": "12. SVG Sprites: Reducing HTML Payload with Symbols",
  "description": "Technique for using SVG sprites with <use> tags to reduce page size and JavaScript bundle for below-the-fold icons and graphics.",
  "content": "---\ndescription: Learn how to use the SVG sprites technique to optimize your website's performance\n---\n\n## Summary\n\n<iframe width=\"100%\" height=\"339\" src=\"https://www.loom.com/embed/e34d5d715f7c4efaae18e4eca799edca\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n\n> To reuse SVG elements and reduce the size of HTML pages:\n>\n> 1. Use a single SVG file (e.g., `sprites.svg`) and identify each symbol with\n>    an `id`.\n> 2. To use the SVG, use the `use` tag pointing to the specific ID.\n> 3. Do this especially for SVGs that are <u>not visible on the screen</u>.\n\n## SVG\n\nSVG (Scalable Vector Graphics) is a graphic format commonly used in applications\nto represent icons, logos, or elements that need to be scaled without losing\nquality. However, its use can negatively impact the performance of a web page in\nvarious metrics, such as page loading time (speed index), time to display the\nfirst visible content (FCP), and time to display the last visible content (LCP).\n\n## The SVG Sprites Technique\n\nSVG sprites consist of having a cacheable and accessible SVG file (e.g., in your\n`static` folder), and within it, have the symbols of each SVG using the\n`<symbol>` tag and adding the `id` property to each element you want to use.\n\nHere's an example of an SVG file with a symbol and ID **XMark**\n\n```html\n<svg style=\"display: none\">\n  <symbol\n    id=\"XMark\"\n    xmlns=\"http://www.w3.org/2000/svg\"\n    fill=\"none\"\n    viewBox=\"0 0 24 24\"\n    stroke-width=\"1.5\"\n    stroke=\"currentColor\"\n  >\n    <path\n      stroke-linecap=\"round\"\n      stroke-linejoin=\"round\"\n      d=\"M6 18L18 6M6 6l12 12\"\n    />\n  </symbol>\n</svg>\n```\n\n## SVG Sprites to improve your website's performance\n\nTo use an SVG that is inside a file, you can reference it using the file's\naddress and the ID of the symbol defined in the file using the `<use>` tag.\n\nHere's an example:\n\nLet's say the name of the SVG file is `icons.svg` and it is available at the\npath `example.com/icons.svg`.\n\n```html\n{/* icons.svg */}\n<svg style=\"display: none\">\n  <symbol\n    id=\"XMark\"\n    xmlns=\"http://www.w3.org/2000/svg\"\n    fill=\"none\"\n    viewBox=\"0 0 24 24\"\n    stroke-width=\"1.5\"\n    stroke=\"currentColor\"\n  >\n    <path\n      stroke-linecap=\"round\"\n      stroke-linejoin=\"round\"\n      d=\"M6 18L18 6M6 6l12 12\"\n    />\n  </symbol>\n</svg>\n```\n\nYou can use the **XMark** inside your html:\n\n```html\n<svg>\n  <use href=\"/icons.svg#XMark\" />\n</svg>\n```\n\nThis way, the size of your page document will not be increased by the size of\nthe **XMark** SVG, as it is not part of your document since it is in another\nfile. In the case of using SVGs within islands, the amount of JavaScript\ngenerated in the bundle will be smaller.\n\n## When to use the technique?\n\n> ⚠️ It is not always appropriate to use the technique, but it is always worth\n> testing.\n\nConsidering that there will be one or several SVG files, with the aim of\nimproving the performance of your site and maintaining excellent usability, it\nis suggested to use this approach in the following cases:\n\n- SVG is not visible on the user's initial screen (not \"above the fold\")\n- SVG is displayed through user interaction on the page, for example: hover,\n  within dialogs, when clicking on buttons\n- In the case of applications that use JSX or similar, which is the case with\n  Fresh, as the amount of JavaScript generated by SVG is considerably large.\n\n**Extra:**\n\nIt is possible to define a symbol within the same document and reference it\nlater in the same document. This approach is valid for cases where a single SVG\nis repeated multiple times on the page and can be used for SVGs that are\ndisplayed above the fold (i.e., visible on the user's screen before their\ninteraction).\n\n```html\n<svg>\n  <use href=\"#XMark\" />\n</svg>\n```\n"
}